---
kind: method
id: M:Autodesk.Revit.DB.Structure.PathReinforcementType.CreateDefaultPathReinforcementType(Autodesk.Revit.DB.Document)
source: html/c16c4768-ba28-1708-8e5f-68f5dd0dfd7d.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcementType.CreateDefaultPathReinforcementType Method

Creates a new PathReinforcementType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultPathReinforcementType(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null